<h1><center>Assignment</center></h1>

In [1]:
import pandas as pd

### Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [2]:
ser = pd.Series([4, 8, 15, 16, 23, 42])
print(ser)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

### Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [3]:
l = [2, 3, 4, 24, 52, 3, 5 ,6 ,65]
print(pd.Series(l))

0     2
1     3
2     4
3    24
4    52
5     3
6     5
7     6
8    65
dtype: int64

### Q3. Create a Pandas DataFrame that contains the following data:
![](q3_image.png)
### Then, print the DataFrame.

In [4]:
data = {
    'Name' : ['Alice', 'Bob', 'Claire'],
    'Age' : [25, 30, 27],
    'Gender' : ['Female', 'Male', 'Female']
}

df = pd.DataFrame(data)
print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

### Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

DataFrame data structure can be thought of as a standard table that is composed of rows and columns. Each column is represented by a Series data structure and a DataFrame (table) is simply a container that holds many Series objects (columns) together.

In pandas, 1-D arrays are stated as a series & a dataframe is simply a 2-D array.

### Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

#### head()
We can read the dataframe by using head() function also which is having an argument (n) i.e. number of rows to be displayed.

In [5]:
df.head(2)

    Name  Age  Gender
0  Alice   25  Female
1    Bob   30    Male

#### shape()
Counting the rows and columns in DataFrame using shape(). It returns the no. of rows and columns enclosed in a tuple.

In [6]:
df.shape

(3, 3)

#### describe()
Summary of Statistics of DataFrame using describe() method.

In [7]:
df.describe()

             Age
count   3.000000
mean   27.333333
std     2.516611
min    25.000000
25%    26.000000
50%    27.000000
75%    28.500000
max    30.000000

#### dropna()
Dropping the missing values in DataFrame, it can be done using the dropna() method, it removes all the NaN values in the dataframe.

In [8]:
df.dropna()

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

#### sort_values()
Sorting the DataFrame using sort_values() method.

In [9]:
df.sort_values(by = ['Age'], ascending=True)

     Name  Age  Gender
0   Alice   25  Female
2  Claire   27  Female
1     Bob   30    Male

In [10]:
df.sort_values(by = ['Age'], ascending=False)

     Name  Age  Gender
1     Bob   30    Male
2  Claire   27  Female
0   Alice   25  Female

### Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

All Pandas data structures are value mutable (can be changed) and except Series all are size mutable. Series is size immutable. DataFrames are both value-mutable and size-mutable1

So, Series is immutable while DataFrame and Panel are mutable in nature.

### Q7. Create a DataFrame using multiple Series. Explain with an example.

You can create a DataFrame using multiple Series by passing a dictionary of Series objects to the DataFrame constructor. The keys of the dictionary will be used as column names and the values of the dictionary will be used as data for each column.

In [11]:
import pandas as pd

data = {'name':pd.Series(['John','Mike','Sarah']),
        'age':pd.Series([28,32,25]),
        'gender':pd.Series(['Male','Male','Female'])}

df = pd.DataFrame(data)

print(df)

    name  age  gender
0   John   28    Male
1   Mike   32    Male
2  Sarah   25  Female